#Написать программу, которая считывает 5 чисел со стандартного ввода и выводит на экран результат их произведения
for i in range(1, 10000000000):
	print(i) 


